Lownoble/Hyleg/STM32/UP_TEST/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stdio.h"
#include <string.h>
#include <ctype.h>
#include <stdlib.h>
#include <stdarg.h>
#include "../icode/tmotor/tmotor.h"
#include "../icode/imu/imu.h"
#include "../icode/mems.h"
#include "../icode/trajectory/trajectory.h"
#include "../icode/gait/gait.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

extern uint8_t  USART1_RX_BUF[200];
extern uint8_t  USART1_RX_FLAG;
extern uint32_t USART1_RX_CNT;
extern uint8_t  USART1_RX_TEMP[1];
extern uint8_t  USART1_TX_BUF[200];

extern uint8_t CAN1_Rx_data[6];
extern uint8_t CAN1_Tx_data[8];
extern uint8_t CAN2_Rx_data[6];
extern uint8_t CAN2_Tx_data[8];
extern uint8_t CAN_FLAG;


extern xyz_s16_t data_acc;
extern xyz_s16_t data_g;
/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Cylinder_L_Pin GPIO_PIN_0
#define Cylinder_L_GPIO_Port GPIOC
#define Cylinder_R_Pin GPIO_PIN_1
#define Cylinder_R_GPIO_Port GPIOC
#define LED2_Pin GPIO_PIN_3
#define LED2_GPIO_Port GPIOB
#define LED1_Pin GPIO_PIN_4
#define LED1_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */
void print_usart1(char *format, ...);
void DmaPrintf(const char *format,...);
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
